{
    "modelTopology": {
        "class_name": "Sequential",
        "config": {
            "name": "sequential_1",
            "layers": [
                {
                    "class_name": "Dense",
                    "config": {
                        "units": 3,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null,
                        "name": "hidden-layer-1",
                        "trainable": true,
                        "batch_input_shape": [
                            null,
                            2
                        ],
                        "dtype": "float32"
                    }
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "units": 2,
                        "activation": "softmax",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null,
                        "name": "dense_Dense1",
                        "trainable": true
                    }
                }
            ]
        },
        "keras_version": "tfjs-layers 4.4.0",
        "backend": "tensor_flow.js"
    },
    "weightsManifest": [
        {
            "binary": "FlNpPja1nT/flym9bqK9P9AqrL9s7Q9Ag7DevkYASz/ZT6q+4jJFvz5jlD/+UpM/IQDfv2ULLsCmaKk/NiSJPzQkib8=",
            "weights": [
                {
                    "name": "hidden-layer-1/kernel",
                    "shape": [
                        2,
                        3
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "hidden-layer-1/bias",
                    "shape": [
                        3
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense1/kernel",
                    "shape": [
                        3,
                        2
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_Dense1/bias",
                    "shape": [
                        2
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ],
    "format": "layers-model",
    "generatedBy": "TensorFlow.js tfjs-layers v4.4.0",
    "convertedBy": null
}